### Terraform `plan` Succeeded for Workspace: `default`
<details><summary>Show Output</summary>

```diff
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+   create
!   update in-place
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # module.lambda_function.aws_lambda_function.this[0] will be updated in-place
!   resource "aws_lambda_function" "this" {
!       handler                        = "app.main.handler" -> "main.handler"
        id                             = "cataprato-auth-lambda"
!       last_modified                  = "2023-08-17T14:58:19.000+0000" -> (known after apply)
!       layers                         = [
-           "arn:aws:lambda:us-east-1:350131064538:layer:cataprato-auth-layer-s3:34",
        ] -> (known after apply)
!       qualified_arn                  = "arn:aws:lambda:us-east-1:350131064538:function:cataprato-auth-lambda:28" -> (known after apply)
!       qualified_invoke_arn           = "arn:aws:apigateway:us-east-1:lambda:path/2015-03-31/functions/arn:aws:lambda:us-east-1:350131064538:function:cataprato-auth-lambda:28/invocations" -> (known after apply)
!       role                           = "arn:aws:iam::350131064538:role/service-role/cataprato-role-0cqzd0zs" -> "arn:aws:iam::350131064538:role/tf-managed/cataprato-auth-lambda"
!       s3_key                         = "lambda-builds/9059828d0c82b27bb47a431e1b8f7cfe44c26ef68c17df26d8d6b2b14f717a39.zip" -> "lambda-builds/0beaad2a946a3e3af397e571f0e97b394af1e9ad8205fbc6a112e4b8d7a000e4.zip"
!       s3_object_version              = "vvxgL48LZbXag_7F2tIHN7H9PmvIlr.r" -> (known after apply)
        tags                           = {
            "Deployment" = "terraform"
        }
!       version                        = "28" -> (known after apply)
        # (16 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.lambda_function.aws_lambda_permission.current_version_triggers["APIGatewayAny"] must be replaced
-/+ resource "aws_lambda_permission" "current_version_triggers" {
!       id                  = "APIGatewayAny" -> (known after apply)
!       qualifier           = "28" -> (known after apply)
+       statement_id_prefix = (known after apply)
        # (5 unchanged attributes hidden)
    }

  # module.lambda_function.aws_s3_object.lambda_package[0] must be replaced
-/+ resource "aws_s3_object" "lambda_package" {
!       bucket_key_enabled     = false -> (known after apply)
!       content_type           = "binary/octet-stream" -> (known after apply)
!       etag                   = "32d010364d620c1e674f404ad978ee07" -> (known after apply)
!       id                     = "lambda-builds/9059828d0c82b27bb47a431e1b8f7cfe44c26ef68c17df26d8d6b2b14f717a39.zip" -> (known after apply)
!       key                    = "lambda-builds/9059828d0c82b27bb47a431e1b8f7cfe44c26ef68c17df26d8d6b2b14f717a39.zip" -> "lambda-builds/0beaad2a946a3e3af397e571f0e97b394af1e9ad8205fbc6a112e4b8d7a000e4.zip"
+       kms_key_id             = (known after apply)
-       metadata               = {} -> null
!       server_side_encryption = "AES256" -> (known after apply)
!       source                 = "./.terraform/lambda-builds/9059828d0c82b27bb47a431e1b8f7cfe44c26ef68c17df26d8d6b2b14f717a39.zip" -> "./.terraform/lambda-builds/0beaad2a946a3e3af397e571f0e97b394af1e9ad8205fbc6a112e4b8d7a000e4.zip"
        tags                   = {
            "Deployment" = "terraform"
        }
!       version_id             = "vvxgL48LZbXag_7F2tIHN7H9PmvIlr.r" -> (known after apply)
        # (5 unchanged attributes hidden)
    }

  # module.lambda_function.local_file.archive_plan[0] will be created
+   resource "local_file" "archive_plan" {
+       content              = jsonencode(
            {
+               artifacts_dir = "./.terraform/lambda-builds/"
+               build_plan    = [
+                   [
+                       "set:filter",
+                       [
+                           "!src/.*",
                        ],
                    ],
+                   [
+                       "zip",
+                       "./app",
+                       null,
                    ],
+                   [
+                       "clear:filter",
                    ],
                ]
+               filename      = "./.terraform/lambda-builds/0beaad2a946a3e3af397e571f0e97b394af1e9ad8205fbc6a112e4b8d7a000e4.zip"
+               runtime       = "python3.10"
            }
        )
+       content_base64sha256 = (known after apply)
+       content_base64sha512 = (known after apply)
+       content_md5          = (known after apply)
+       content_sha1         = (known after apply)
+       content_sha256       = (known after apply)
+       content_sha512       = (known after apply)
+       directory_permission = "0755"
+       file_permission      = "0644"
+       filename             = "./.terraform/lambda-builds/0beaad2a946a3e3af397e571f0e97b394af1e9ad8205fbc6a112e4b8d7a000e4.plan.json"
+       id                   = (known after apply)
    }

  # module.lambda_function.null_resource.archive[0] must be replaced
-/+ resource "null_resource" "archive" {
!       id       = "944218862257875596" -> (known after apply)
!       triggers = {
!           "filename"  = "./.terraform/lambda-builds/9059828d0c82b27bb47a431e1b8f7cfe44c26ef68c17df26d8d6b2b14f717a39.zip" -> "./.terraform/lambda-builds/0beaad2a946a3e3af397e571f0e97b394af1e9ad8205fbc6a112e4b8d7a000e4.zip"
!           "timestamp" = "1692232151849617000" -> "1692299954276054000"
        }
    }

  # module.lambda_function.null_resource.sam_metadata_aws_lambda_function[0] must be replaced
-/+ resource "null_resource" "sam_metadata_aws_lambda_function" {
!       id       = "1789763310970006169" -> (known after apply)
!       triggers = {
!           "built_output_path"    = "./.terraform/lambda-builds/9059828d0c82b27bb47a431e1b8f7cfe44c26ef68c17df26d8d6b2b14f717a39.zip" -> "./.terraform/lambda-builds/0beaad2a946a3e3af397e571f0e97b394af1e9ad8205fbc6a112e4b8d7a000e4.zip"
!           "original_source_code" = jsonencode(
!               [
!                   {
!                       path          = "./src" -> "./app"
!                       patterns      = <<-EOT
                            !src/.*
                        EOT
-                       prefix_in_zip = "app"
                    },
                ]
            )
            # (3 unchanged elements hidden)
        }
    }

  # module.lambda_layer_s3.aws_lambda_layer_version.this[0] must be replaced
-/+ resource "aws_lambda_layer_version" "this" {
!       arn                         = "arn:aws:lambda:us-east-1:350131064538:layer:cataprato-auth-layer-s3:34" -> (known after apply)
-       compatible_architectures    = [] -> null
!       created_date                = "2023-08-17T00:30:12.594+0000" -> (known after apply)
!       id                          = "arn:aws:lambda:us-east-1:350131064538:layer:cataprato-auth-layer-s3:34" -> (known after apply)
!       layer_arn                   = "arn:aws:lambda:us-east-1:350131064538:layer:cataprato-auth-layer-s3" -> (known after apply)
!       s3_key                      = "builds/177d6aecc08abd379d7cabe7b036c10b61975f2f76651e2c5e6b700ef05a5abd.zip" -> "builds/1b8afb68333e4105e02f633c685a2be3f1676d662dfec2261635de4e8eb0a692.zip"
!       s3_object_version           = "4SjFK5TeFVaoTlawQzVu0L3QRuAXGKJl" -> (known after apply)
+       signing_job_arn             = (known after apply)
+       signing_profile_version_arn = (known after apply)
!       source_code_hash            = "xydyZdH2zSC1GVQNnaU5qojseRgt2ZdrxGXLhORCtA0=" -> (known after apply)
!       source_code_size            = 29717837 -> (known after apply)
!       version                     = "34" -> (known after apply)
        # (5 unchanged attributes hidden)
    }

  # module.lambda_layer_s3.aws_s3_object.lambda_package[0] must be replaced
-/+ resource "aws_s3_object" "lambda_package" {
!       bucket_key_enabled     = false -> (known after apply)
!       content_type           = "binary/octet-stream" -> (known after apply)
!       etag                   = "75590d08f1c43fc5f1b4437c6a56bdf0-6" -> (known after apply)
!       id                     = "builds/177d6aecc08abd379d7cabe7b036c10b61975f2f76651e2c5e6b700ef05a5abd.zip" -> (known after apply)
!       key                    = "builds/177d6aecc08abd379d7cabe7b036c10b61975f2f76651e2c5e6b700ef05a5abd.zip" -> "builds/1b8afb68333e4105e02f633c685a2be3f1676d662dfec2261635de4e8eb0a692.zip"
+       kms_key_id             = (known after apply)
-       metadata               = {} -> null
!       server_side_encryption = "AES256" -> (known after apply)
!       source                 = "builds/177d6aecc08abd379d7cabe7b036c10b61975f2f76651e2c5e6b700ef05a5abd.zip" -> "builds/1b8afb68333e4105e02f633c685a2be3f1676d662dfec2261635de4e8eb0a692.zip"
        tags                   = {
            "Deployment" = "terraform"
        }
!       version_id             = "4SjFK5TeFVaoTlawQzVu0L3QRuAXGKJl" -> (known after apply)
        # (5 unchanged attributes hidden)
    }

  # module.lambda_layer_s3.local_file.archive_plan[0] will be created
+   resource "local_file" "archive_plan" {
+       content              = jsonencode(
            {
+               artifacts_dir = "builds"
+               build_plan    = [
+                   [
+                       "zip",
+                       "dist",
+                       null,
                    ],
                ]
+               filename      = "builds/1b8afb68333e4105e02f633c685a2be3f1676d662dfec2261635de4e8eb0a692.zip"
+               runtime       = ""
            }
        )
+       content_base64sha256 = (known after apply)
+       content_base64sha512 = (known after apply)
+       content_md5          = (known after apply)
+       content_sha1         = (known after apply)
+       content_sha256       = (known after apply)
+       content_sha512       = (known after apply)
+       directory_permission = "0755"
+       file_permission      = "0644"
+       filename             = "builds/1b8afb68333e4105e02f633c685a2be3f1676d662dfec2261635de4e8eb0a692.plan.json"
+       id                   = (known after apply)
    }

  # module.lambda_layer_s3.null_resource.archive[0] must be replaced
-/+ resource "null_resource" "archive" {
!       id       = "6545938589994007207" -> (known after apply)
!       triggers = {
!           "filename"  = "builds/177d6aecc08abd379d7cabe7b036c10b61975f2f76651e2c5e6b700ef05a5abd.zip" -> "builds/1b8afb68333e4105e02f633c685a2be3f1676d662dfec2261635de4e8eb0a692.zip"
!           "timestamp" = "1692232153456561000" -> "1692299955940196000"
        }
    }

  # module.lambda_layer_s3.null_resource.sam_metadata_aws_lambda_layer_version[0] must be replaced
-/+ resource "null_resource" "sam_metadata_aws_lambda_layer_version" {
!       id       = "2306859332807905831" -> (known after apply)
!       triggers = {
!           "built_output_path"    = "builds/177d6aecc08abd379d7cabe7b036c10b61975f2f76651e2c5e6b700ef05a5abd.zip" -> "builds/1b8afb68333e4105e02f633c685a2be3f1676d662dfec2261635de4e8eb0a692.zip"
            # (4 unchanged elements hidden)
        }
    }

Plan: 10 to add, 1 to change, 8 to destroy.
```
</details>